const people = [
  "耶和華",
  "亞當",
  "夏娃",
  "該隱",
  "亞伯",
  "挪亞",
  "亞伯拉罕",
  "撒拉",
  "以撒",
  "以掃",
  "雅各",
  "約瑟",
  "摩西",
  "亞倫",
  "約書亞",
  "路得",
  "以斯帖",
  "以斯拉",
  "尼希米",
  "以利亞",
  "約伯",
  "大衛",
  "掃羅",
  "歌利亞",
  "但以理",
  "耶穌",
  "彼得",
  "約翰",
  "保羅",
  "路加"
]

const nature = [
  "太陽",
  "地球",
  "月亮",
  "山",
  "黃金",
  "銀子",
  "銅",
  "鐵",
  "石頭",
  "綿羊",
  "山羊",
  "獅子",
  "河馬",
  "駱駝",
  "鱷魚",
  "螞蟻",
  "鴿子",
  "蛇",
  "牛",
  "豬",
  "蛋",
  "魚",
  "大樹",
  "露水",
  "百合花",
  "葡萄",
  "麵粉",
  "橄欖油"
]

const things = [
  "神聖力量",
  "愛心",
  "喜樂",
  "希望",
  "信心",
  "謙卑",
  "叛道",
  "陷阱",
  "墳墓",
  "死亡",
  "偶像",
  "生命",
  "伊甸園",
  "埃及",
  "耶路撒冷",
  "羅馬",
  "聖幕",
  "祭",
  "船",
  "車",
  "弓",
  "箭",
  "頭盔",
  "腰帶",
  "鞋子",
  "盾牌",
  "劍",
  "鎖鏈",
  "牧人",
  "君王",
  "長老",
]
const others = [
  "啟示錄"
]


export const BibleItemLists = { people, nature, others, things }

export function shuffle(arr) {
  return arr.map(val => ({ val, sort: Math.random() }))
    .sort((a, b) => a.sort - b.sort)
    .map(({ val }) => val)
}